Question 1

Question: Select all numeric columns except float from the DataFrame dft.

Answer:

In [86]:
import numpy as np
import pandas as pd

In [87]:
dft = pd.DataFrame({
    'a': pd.Series([1, 2, 3, 4, 5, 6], dtype='int64'),
    'b': pd.Series([2.0, 1.5, 3.6, 8.4, 5.9], dtype='float32'),
    'c': pd.Series([6, 5, 4, 3, 2, 1], dtype='int64'),
    'd': pd.Series([True, False, True, False, True, False]),
    'e': pd.Series(['a', 'b', 'c', 'd', 'e', 'f']),
})
dft

   a    b  c      d  e
0  1  2.0  6   True  a
1  2  1.5  5  False  b
2  3  3.6  4   True  c
3  4  8.4  3  False  d
4  5  5.9  2   True  e
5  6  NaN  1  False  f

In [88]:
dft.select_dtypes(include=['number'], exclude=['float'])

   a  c
0  1  6
1  2  5
2  3  4
3  4  3
4  5  2
5  6  1

Question 2

Question: How do you return the last 3 rows of a DataFrame df?

Answer:

In [89]:
df = dft
df.tail(3)

   a    b  c      d  e
3  4  8.4  3  False  d
4  5  5.9  2   True  e
5  6  NaN  1  False  f

Question 3

Question: Return the minimum and maximum of a Series x as a new Series with the index ["min", "max"].

Answer:

In [90]:
x = pd.Series(np.random.randint(1, 100, size=5))

x

0    34
1    27
2     9
3    65
4    75
dtype: int64

In [91]:
y = pd.Series([x.min(),x.max()], index=["min","max"])

y

min     9
max    75
dtype: int64

Question 4

Question: Multiply df1 and df2 (two DataFrames) with a fill_value of 1.

Answer:

In [92]:
df1 = pd.DataFrame([[1,2],[3,4]], columns=list("ab"), index=["Colorado", "Texas"])

df1

          a  b
Colorado  1  2
Texas     3  4

In [93]:
df2 = pd.DataFrame([[5,6],[7,8]], columns=list("ab"), index=["Ohio", "Texas"])

df2

       a  b
Ohio   5  6
Texas  7  8

In [94]:
df1.multiply(df2)

             a     b
Colorado   NaN   NaN
Ohio       NaN   NaN
Texas     21.0  32.0

In [95]:
df1.multiply(df2, fill_value=1)

             a     b
Colorado   1.0   2.0
Ohio       5.0   6.0
Texas     21.0  32.0

Question 5

Question: How do you create a DataFrame from a nested dictionary of dictionaries?

In [96]:
nested_dict = {'A': {'a': 1, 'b': 2}, 'B': {'a': 3, 'b': 4}}

Answer:

In [97]:
df3 = pd.DataFrame(nested_dict)
df3

   A  B
a  1  3
b  2  4